cf_billing/InformationRegisters/энргИсполнителиОРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргИсполнителиОРП</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсполнительОРП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргИсполнителиОРП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает исполнителя ОРП.
//
// Параметры:
//  Строение	-	СправочникСсылка.энргСтроения.
//  Исполнитель	-	СправочникСсылка.энргКонтрагенты.
//  Период		-	Дата.
//
Процедура УстановитьИсполнителяОРП(Строение, Исполнитель, Период) Экспорт

	ЗаписьРС = РегистрыСведений.энргИсполнителиОРП.СоздатьМенеджерЗаписи();
	
	ЗаписьРС.Строение 		 = Строение;
	ЗаписьРС.Период 		 = Период;
	ЗаписьРС.ИсполнительОРП  = Исполнитель;
	
	ЗаписьРС.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
